#+TITLE: Spacy and Custom NER
#+AUTHOR: Josh Smith <kognate@gmail.com>
#+OPTIONS: H:2 toc:t num:t
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation]
#+LATEX_HEADER: \usepackage{minted}
#+BEAMER_THEME: Pittsburgh

** Stop Words

- These are glue words and things that can be ignored sometimes.

#+begin_src python :session :noweb yes :results value :exports both
  doc = nlp(('These are glue words and'
             ' things that can be '
             'ignored sometimes.'))
  [(x.lemma_, x.pos_, x.text)
   for x
   in [y
       for y
       in doc
       if y.is_stop]]
#+end_src

#+RESULTS:
| be        | VERB  | are       |
| and       | CCONJ | and       |
| that      | ADJ   | that      |
| can       | VERB  | can       |
| be        | VERB  | be        |
| sometimes | ADV   | sometimes |

** Now we can use it

#+begin_src python :session :noweb yes :results value :tangle example.py :exports both
  <<importheader>>
  doc = nlp("Hello everyone, I've some good news to give you")
  cleaned = [y for y
             in doc
             if not y.is_stop and y.pos_ != 'PUNCT']
  raw = [(x.lemma_, x.pos_) for x in cleaned]
  print(raw)
  raw
#+end_src

#+RESULTS:
| hello  | INTJ |
| -PRON- | PRON |
| have   | VERB |
| good   | ADJ  |
| news   | NOUN |

* Named Entity Recognition in Spacy

#+begin_src python :session :results value :tangle entities.py :noweb yes :exports both
  <<importheader>>
  to_analyze = ('Hello Code & Supply, '
                'my name is Josh and tonight '
                'we\'re in Pittsburgh')
  doc = nlp(to_analyze)
  ents = [(x.text, x.label_)
          for x in doc.ents] 
  print(ents)
  ents
#+end_src

#+RESULTS:
| Josh       | PERSON |
| tonight    | TIME   |
| Pittsburgh | GPE    |

  - https://spacy.io/api/annotation
** What's that look like?

#+begin_src python :session :exports both :results value
  one = nlp('Gina Haspel was nomiated in 2018')
  matches = matcher(one)
  [match for match in matches]
#+end_src

#+RESULTS:
| 1.7539557946531887e+19 | 0 | 1 |
| 1.7539557946531887e+19 | 0 | 2 |
| 1.7539557946531887e+19 | 1 | 2 |

** Gcloud

#+BEGIN_EXAMPLE
  gcloud init
  gcloud auth configure-docker
  gcloud auth print-access-token
  # then cut and paste that token
  docker login -u oauth2accesstoken https://gcr.io
  # you must have enabled the container registry before you can push
  docker push gcr.io/codeandsupply/stemmer:latest
  gcloud container clusters create experimental-aone
  gcloud container clusters get-credentials experimental-aone
  kubectl run stemmer-server 
         --image gcr.io/codeandsupply/stemmer:latest
         --port 8000
  kubectl expose deployment stemmer-server --type "LoadBalancer"
  kubectl get service stemmer-server
  curl http://<HOSTNAME>:8000/
#+END_EXAMPLE

#+begin_src sh :results value
curl -s "http://127.0.0.1:8000/stemmer?source=Bill+is+a+nice+guy" 
#+end_src

#+RESULTS:
| bill":"PROPN | NOUN | ADJ |

#+begin_src sh :results value
curl -s http://127.0.0.1:8000/ents?fragment=Bill+is+a+nice+guy
#+end_src

#+RESULTS:
: Bill":"PERSON

#+begin_src sh :results value
curl -s "http://localhost:8000/ents?custom=1&fragment=Gina+has+often+joined+me+and+other+senior+national+security+leaders+for+intelligence+briefings+to+President+Trump"
#+end_src

#+RESULTS:
: Gina":"CIADIR

